{"inkVersion":21,"root":[["\n","ev",{"VAR?":"historyProgression"},"/ev",["du","ev",0,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":"Fase1_1"},{"->":"0.11"},null]}],["du","ev",1,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":"Fase1_2"},{"->":"0.11"},null]}],["du","ev",2,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":"Fase1_3"},{"->":"0.11"},null]}],["du","ev",3,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":"Fase1_4"},{"->":"0.11"},null]}],["du","ev",4,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":"Fase1_5"},{"->":"0.11"},null]}],["du","ev",5,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":"Fase1_7"},{"->":"0.11"},null]}],"pop","nop","\n","^nada.","\n",["done",{"#f":5,"#n":"g-0"}],null],"done",{"Fase1_1":[["^Bom dia! Onde estão as correspondências? ","#","^speaker:???????","/#","\n","ev","str","^desculpe, o que?","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","^Você sabe, as encomendas!","\n","^...","\n","^Oh,me desculpe você não é o entregador, se eu estiver certa, deve ser o novo estagiário, muito prazer!","\n",["ev","str","^sim, sou eu","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","^Como eu imaginava! Meu nome é Felícia, sou a desenvolvedora Front-end e você é ?","\n",["ev","str","^Carlos","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Rodrigo","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^João","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Ana","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["^ ","\n","ev","str","^Carlos","/str","/ev",{"VAR=":"playerName","re":true},{"->":"Fase1_1.A"},{"#f":5}],"c-1":["\n","ev","str","^Rodrigo","/str","/ev",{"VAR=":"playerName","re":true},{"->":"Fase1_1.A"},{"#f":5}],"c-2":["\n","ev","str","^João","/str","/ev",{"VAR=":"playerName","re":true},{"->":"Fase1_1.A"},{"#f":5}],"c-3":["\n","ev","str","^Ana","/str","/ev",{"VAR=":"playerName","re":true},{"->":"Fase1_1.A"},{"#f":5}]}],{"#f":5}]}],{"#f":5}]}],{"A":["^Bem vindo ao time ","ev",{"VAR?":"playerName"},"out","/ev","^ , espero que você se acomode muito bem aqui ! Nossa equipe é bem diversificada. Vem! Vou te apresentar aos outros, eles devem estar na sala de reuniões.","#","^speaker:Felicia","/#","\n","ev",1,"/ev",{"VAR=":"historyProgression","re":true},"ev",{"x()":"finalizarQuestStep"},"pop","/ev","\n","end",{"#f":1}],"#f":1}],"Fase1_2":["^Como eu esperava, aí estão vocês!","#","^speaker:Felicia","/#","\n","^\"Logo depois a líder de projeto atribui a tarefa de acompanhar o Sávio que é o desenvolvedor back-end sênior, a equipe está encarregada de trabalhar em um projeto para o setor de RH de uma grande empresa. A  proposta é criar um software que facilite a análise de currículo dos funcionários atuais e dos futuros, para encontrar aqueles que melhor se adequam ao cargo de acordo com sua formação e habilidades. A reunião se estende até a hora do almoço e se encerra com todos indo fazer suas refeições, o The player fica encarregado de procurar pelo Sávio quando a pausa acabar.\"","#","^speaker:Narrador","/#","\n","ev",2,"/ev",{"VAR=":"historyProgression","re":true},"ev",{"x()":"finalizarQuestStep"},"pop","/ev","\n","end",{"#f":1}],"Fase1_3":["^Após o almoço, o The player se encaminha para sala do Sávio, se anuncia e logo entra iniciando o diálogo. Ambos conversam e Sávio explica sobre as tarefas e a dinâmica do expediente.","\n","ev",3,"/ev",{"VAR=":"historyProgression","re":true},"ev",{"x()":"finalizarQuestStep"},"pop","/ev","\n","end",{"#f":1}],"Fase1_4":[["^Tudo ocorreu como o esperado durante a primeira semana. É segunda novamente, Sávio está em sua sala conversando com Raquel ( Requisitos ) ,o the player se encontra apenas como ouvinte, a respeito de alguns requisitos do projeto que parecem peculiares e parecem desnecessários. Contudo o cliente exigiu que esses fossem atendidos e sejam inseridos com prioridade mesmo que atrase outras funcionalidades mais relevantes. Um destes requisitos é o desenvolvimento de um filtro automatizado que leva em conta, sexo, raça, orientação sexual e religião para a escolha do candidato que venha preencher determinada vaga.","\n","^Você não concorda comigo que o planejamento de requisitos é adequado e segue exatamente o que nos foi solicitado?","#","^speaker:Raquel","/#","\n","ev","str","^Sim, realizar os pedidos do cliente é sempre o maior objetivo.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Em parte sim! Mas será que não podemos conversar com o cliente a respeito?","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Não! Priorizar o filtro e ignorar as demais funcionalidades parece tolice.","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n",{"->":".^.^.^.A"},{"#f":5}],"c-1":["\n",{"->":".^.^.^.B"},{"#f":5}],"c-2":["\n",{"->":".^.^.^.C"},{"#f":5}]}],{"A":["^Raquel concorda.","\n","^Sávio discorda, argumenta que você não tem experiência para dar uma opinião fundamentada, prefere levar isso para a próxima reunião e discutir com quem realmente deve opinar no projeto.","\n","ev",4,"/ev",{"VAR=":"historyProgression","re":true},"ev","str","^requirements","/str",10,{"x()":"increaseRelationship","exArgs":2},"pop","/ev","\n","ev",{"x()":"finalizarQuestStep"},"pop","/ev","\n","end",{"#f":1}],"B":["^Raquel desaprova um pouco e  diz que não é tão fácil quanto parece mudar algo que já foi acertado anteriormente","\n","^Sávio aprova e ele diz que comunicação é o melhor caminho e que vai levar o assunto para a próxima reunião.","\n","ev",4,"/ev",{"VAR=":"historyProgression","re":true},"ev",{"x()":"finalizarQuestStep"},"pop","/ev","\n","end",{"#f":1}],"C":["^Raquel desaprova e diz que todos os requisitos foram anteriormente bem discutidos e definidos por ela e o cliente, sendo ousadia da sua parte questionar como tolice a vontade deste.","\n","^Sávio aprova um pouco e ele diz que antes de fazer qualquer julgamento é melhor discutirmos mais sobre o assunto na próxima reunião.","\n","ev",4,"/ev",{"VAR=":"historyProgression","re":true},"ev",{"x()":"finalizarQuestStep"},"pop","/ev","\n","end",{"#f":1}],"#f":1}],"Fase1_5":[["^Está pronto para a reunião?","\n","ev","str","^sim","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^não","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"Fase1_6"},{"#f":5}],"c-1":["\n","^okay","\n","end",{"#f":5}]}],{"#f":1}],"Fase1_6":["^Conforme o horário marcado, na sala de reuniões Luiza começa falando que estava ciente das agitações na equipe com relação ao planejamento de requisitos e por isso para a reunião de hoje ela incluiu os donos do projeto que está em desenvolvimento.","\n","^Logo, o representante da empresa entra na chamada e  Luiza inicia explicação das pautas da reunião e em seguida questiona a possibilidade do requisito ser desconsiderado e estabelecer como prioridade as outras funcionalidades mais \"estruturais\"","\n","^O stakeholder diz que como foi planejado anteriormente, preferia que esse \"sistema de filtragem\" continue como o primeiro a ser implementado.","\n","^A líder de projeto pede esclarecimento quanto ao motivo.","\n","^Em contrapartida ,o stakeholder insiste que é pedido direto de sua empresa e deixa claro que não há abertura para questionamentos.","\n","^A líder de projeto então tenta negociar para amenizar os campos do filtro, removendo algumas funcionalidades como os campos de gênero, etnia, orientação sexual e religião.","\n","^O stakeholder diz que não é possível, pois são indispensáveis para os interesses da empresa e que cabe a eles somente executar conforme o que foi descrito e solicitado.","\n","^A front-end entra no meio e insiste em perguntar que interesses são esses em  querem saber sobre cada candidato essas características específicas, o que faz parecer que eles querem favorecer certos grupos.","\n","^Irritado, ele argumenta que é mais simples do que parece, a empresa quer começar a passar uma visão de inclusividade mas  para isso precisa filtrar os candidatos que são mulheres e que são negros, contrata-los e aumentar a porcentagem dessas minorias dentro da empresa.","\n","^Felícia rebate: Tudo bem quanto ao sexo e etnia, mas e quanto à orientação sexual e a religião?","\n","^O stakeholder revira os olhos e fala de forma grosseira que são interesses da empresa, não vai ficar explicando algo que já foi planejado anteriormente com a requisitos, cumprimenta a líder, saindo abruptamente da chamada.","\n","^A líder dá uma bronca na front-end, constrangendo - a  na frente dos outros membros que continuam sentados.","\n","^Após um breve momento de silêncio, a front-end começa a dizer que estava na cara que a empresa estava querendo era um sistema discriminatório e pergunta irritada para a requisitos o porquê dela ter aceitado aquilo. Raquel  se defende dizendo que aquilo era um exagero e quando planejou os requisitos, embora alguns fossem estranhos,não pareciam representar nenhum mal.Neste momento Sávio entra na conversa, exaltado, diz que Felícia está sendo intrometida demais e que apoia o ponto de vista da requisitos, continua, dizendo que Felícia deveria exercer sua função sem questionar, já que o papel dela é só enfeitar o trabalho de todos, assim como todas as outras fazem.Pela fala dele incluir todas as outras integrantes da equipe, a conversa ganha maiores proporções e num instante instalou-se um clima inóspito, resultando em um grande bate-boca.","\n","^A líder da equipe interrompe e toma as rédeas da situação ordenando  que fiquem calados, em seguida adia a reunião e os dispensa.","\n","^Todos saem da sala, exceto a front-end que se sente ofendida e exige uma retratação da parte de Sávio, pelo que foi dito. Luiza reconhece o erro de Sávio e diz que vai conversar com ele.","\n","ev",5,"/ev",{"VAR=":"historyProgression","re":true},"ev",{"x()":"finalizarQuestStep"},"pop","/ev","\n","end",{"#f":1}],"Fase1_7":[["^Está pronto para a reunião?","\n","ev","str","^sim","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^não","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"Fase1_7_1"},{"#f":5}],"c-1":["\n","^okay","\n","end",{"#f":5}]}],{"#f":1}],"Fase1_7_1":[["^Chega o momento de todos reunirem na na sala , antes do stakeholder entrar na chamada a líder discute com todos o que pensam daquela situação e sobre a possível discriminação que poderia ocorrer.","\n","^O banco de dados e o back-end Sênior são neutros na situação, o que for decidido terá o aval deles.","\n","^A líder de projeto, a Front-end, a Requisitos e o tester são contra a implementação do sistema no planejamento atual, acreditando que a funcionalidade deve ser no mínimo alterada, senão, completamente excluída. E caso o stakeholder não concorde com as mudanças, o projeto será abandonado.","\n","^Então é perguntado ao jogador sobre o posicionamento dele:","\n","ev","str","^dizer que o planejamento inicial não tinha nada de errado e que não precisava mudar de forma alguma","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^dizer que acha que as mudanças precisam ser feitas pelo bem do prazo, independente se haverá discriminação ou não.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^dizer que acha que as mudanças precisam ser feitas, principalmente para evitar discriminação.","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^dizer que acha que era melhor abandonar o projeto completamente, por conta da discriminação.","/str","/ev",{"*":".^.c-3","flg":20},{"c-0":["\n",{"->":".^.^.^.A"},{"#f":5}],"c-1":["\n",{"->":".^.^.^.B"},{"#f":5}],"c-2":["\n",{"->":".^.^.^.C"},{"#f":5}],"c-3":["\n",{"->":".^.^.^.D"},{"#f":5}]}],{"A":[[["^perde pontos de ética","\n",["^lider de projeto, desaprova","\n",["^back-end sênior, desaprova um pouco","\n",["^front-end, desaprova","\n",["^requisitos, desaprova um pouco","\n",["^tester, desaprova um pouco","\n",["^banco de dados, reage de forma neutra","\n","ev",25,{"x()":"decreaseEthicMeter","exArgs":1},"pop","/ev","\n",{"->":"Fase1_7_2"},{"#f":5,"#n":"g-6"}],{"#f":5,"#n":"g-5"}],{"#f":5,"#n":"g-4"}],{"#f":5,"#n":"g-3"}],{"#f":5,"#n":"g-2"}],{"#f":5,"#n":"g-1"}],{"#f":5,"#n":"g-0"}],null],{"#f":1}],"B":[[["^perde pontos de ética","\n",["^lider de projeto, desaprova um pouco","\n",["^back-end sênior, aprova um pouco","\n",["^front-end, desaprova","\n",["^requisitos, desaprova","\n",["^tester, desaprova um pouco","\n",["^banco de dados, reage de forma neutra","\n","ev",25,{"x()":"decreaseEthicMeter","exArgs":1},"pop","/ev","\n",{"->":"Fase1_7_2"},{"#f":5,"#n":"g-6"}],{"#f":5,"#n":"g-5"}],{"#f":5,"#n":"g-4"}],{"#f":5,"#n":"g-3"}],{"#f":5,"#n":"g-2"}],{"#f":5,"#n":"g-1"}],{"#f":5,"#n":"g-0"}],null],{"#f":1}],"C":[[["^ganha pontos de ética","\n",["^lider de projeto, aprova","\n",["^back-end sênior, aprova um pouco","\n",["^front-end, aprova","\n",["^requisitos, aprova","\n",["^tester, aprova um pouco","\n",["^banco de dados, reage de forma neutra","\n","ev",25,{"x()":"increaseEthicMeter","exArgs":1},"pop","/ev","\n",{"->":"Fase1_7_2"},{"#f":5,"#n":"g-6"}],{"#f":5,"#n":"g-5"}],{"#f":5,"#n":"g-4"}],{"#f":5,"#n":"g-3"}],{"#f":5,"#n":"g-2"}],{"#f":5,"#n":"g-1"}],{"#f":5,"#n":"g-0"}],null],{"#f":1}],"D":[[["^ganha pontos de ética","\n",["^lider de projeto, desaprova","\n",["^back-end sênior, desaprova","\n",["^front-end, aprova","\n",["^requisitos, desaprova","\n",["^tester, desaprova um pouco","\n",["^banco de dados, desaprova um pouco","\n","ev",25,{"x()":"increaseEthicMeter","exArgs":1},"pop","/ev","\n",{"->":"Fase1_7_2"},{"#f":5,"#n":"g-6"}],{"#f":5,"#n":"g-5"}],{"#f":5,"#n":"g-4"}],{"#f":5,"#n":"g-3"}],{"#f":5,"#n":"g-2"}],{"#f":5,"#n":"g-1"}],{"#f":5,"#n":"g-0"}],null],{"#f":1}],"#f":1}],"Fase1_7_2":["^Após ouvir a opinião de todos, finalmente, se inicia a reunião com o stakeholder.","\n","^A líder de projeto começa com os argumentos de que a funcionalidade estava atrasando o desenvolvimento de outras mais importantes.O stakeholder responde friamente que já disse que era uma funcionalidade prioritária.","\n","^Em oposição , a lider de projeto então fala que se não é possível remover a funcionalidade, deve-se modificar, principalmente pela sua equipe estar preocupada com a possibilidade do algoritmo ser utilizado como uma ferramenta para discriminação.","\n","^Ouvindo isso,o stakeholder recua e resolve dar visão ao que  eles têm a dizer.","\n","^Com isso,a líder de projeto explica os problemas envolvendo principalmente os campos de \"religião\", \"orientação sexual\", e sobre como esse \"filtro\" funcionaria se baseando nos dados dos funcionários de cada categoria, dessa forma recomendando candidatos que manteriam as diferenças etnicas e de sexo equilibridas.","\n","^O stakeholder argumenta que isso complicaria em vez de simplificar.","\n","^A líder de projeto concorda que acaba sendo mais complicado,porém mais justo e que a parte das recomendações automáticas seria feita depois do registro geral de funcionários, como algo complementar. Dessa forma poderiam focar primeiro na parte mais importante.Por fim, o stakeholder concorda e a reunião se encerra.","\n","^Todos ficam satisfeitos com o resultado.Após encerrar a chamada, Luiza dá a oportunidade de Sávio se retratar, mas ele o faz de forma breve e objetiva sem mostrar muito entusiasmo. O clima não melhora entre a equipe, já que as garotas seguem afetadas pelo ocorrido, e então todos são dispensados.","\n","ev",{"x()":"finalizarQuestStep"},"pop","/ev","\n","end",{"#f":1}],"global decl":["ev","str","^","/str",{"VAR=":"playerName"},0,{"VAR=":"historyProgression"},"/ev","end",null],"#f":1}],"listDefs":{}}