{"inkVersion":21,"root":[["\n","ev",{"VAR?":"historyProgression"},"/ev",["du","ev",4,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":"Fase1_5_f"},{"->":"0.7"},null]}],["du","ev",5,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":"Fase1_6_f"},{"->":"0.7"},null]}],"pop","nop","\n","^nada.","\n",["done",{"#f":5,"#n":"g-0"}],null],"done",{"Fase1_5_f":["^Felicia diz que achou completamente sem sentido esse requisito, fica subentendido o interesse dos clientes em criar algo para favorecer certos grupos e se for o caso, poderá ser considerado discriminação e ocasionará problemas futuros. Ela sugere que a líder averigue as intenções do cliente e alerte a respeito de uma possível infração à ética que a equipe pode cometer se seguir o que foi pedido e só levar em consideração a remuneração pela execução, assim como Raquel quer que seja feito.","\n","end",{"#f":1}],"Fase1_6_f":[["ev","str","^O que acha em relação a suposta discriminação?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^O que acha em relação a esses requisitos?","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^O que acha em relação a forma como o stakeholder reagiu?","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Qual sua atitude quanto a atitude de Sávio?","/str","/ev",{"*":".^.c-3","flg":4},"ev","str","^Até mais","/str","/ev",{"*":".^.c-4","flg":4},{"c-0":["\n",{"->":".^.^.^.A"},{"#f":5}],"c-1":["\n",{"->":".^.^.^.B"},{"#f":5}],"c-2":["\n",{"->":".^.^.^.C"},{"#f":5}],"c-3":["\n",{"->":".^.^.^.D"},{"#f":5}],"c-4":["\n","end",{"#f":5}]}],{"A":["^Eu tenho quase certeza que esse é o real motivo deles quererem algo assim, pra mim não tem outra explicação eles quererem algo tão específico com tanta prioridade.","\n",{"->":".^.^"},{"#f":1}],"B":["^MUITO sugestivo quanto ao uso do software, eu não trabalho a tanto tempo na área como alguns de nossos colegas, mas eu tenho certeza que nenhum deles já viu algo assim, isso só reforça minha ideia que é discriminação.","\n",{"->":".^.^"},{"#f":1}],"C":["^Ele se diz profissional, mas para se exaltar daquela forma com certeza deve ter alguma culpa.","\n",{"->":".^.^"},{"#f":1}],"D":["^Me senti completamente ofendida e de certa forma humilhada, já que ele desmereceu o meu trabalho e minha capacidade. Foi horrível da parte generalizar todas nós, me fez questionar sobre os princípios com os quais ele foi criado, espero que a Luíza faça algo a respeito. Minha relação com ele será estritamente profissional daqui para frente , não pretendo manter contato fora desse ambiente.","\n",{"->":".^.^"},{"#f":1}],"#f":1}],"global decl":["ev","str","^","/str",{"VAR=":"playerName"},0,{"VAR=":"historyProgression"},"/ev","end",null],"#f":1}],"listDefs":{}}