{"inkVersion":21,"root":[["\n","ev",{"VAR?":"historyProgression"},"/ev",["du","ev",4,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":"Fase1_5_l"},{"->":"0.7"},null]}],["du","ev",5,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":"Fase1_6_l"},{"->":"0.7"},null]}],"pop","nop","\n","^nada.","\n",["done",{"#f":5,"#n":"g-0"}],null],"done",{"Fase1_5_l":["^Luíza concorda que deveriam rever os requisitos, afinal pode causar um atraso em uma funcionalidade que não tem tanta importância quanto as outras, além de que é um requisito estranho que ela nunca viu de forma tão específica e a defesa de Raquel em mantê-lo parece infundável.","\n","end",{"#f":1}],"Fase1_6_l":[["ev","str","^O que acha em relação a suposta discriminação?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^O que acha em relação a esses requisitos?","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^O que acha em relação a forma como o stakeholder reagiu?","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Qual sua atitude quanto a atitude de Sávio?","/str","/ev",{"*":".^.c-3","flg":4},"ev","str","^Até mais","/str","/ev",{"*":".^.c-4","flg":4},{"c-0":["\n",{"->":".^.^.^.A"},{"#f":5}],"c-1":["\n",{"->":".^.^.^.B"},{"#f":5}],"c-2":["\n",{"->":".^.^.^.C"},{"#f":5}],"c-3":["\n",{"->":".^.^.^.D"},{"#f":5}],"c-4":["\n","end",{"#f":5}]}],{"A":["^Se a discriminação realmente está ocorrendo eu não posso afirmar, mas temos que nos manter atentos quanto a isso. Para algumas pessoas pode parecer um grande exagero, mas esse tipo de coisa realmente ocorre, e é dever ético nosso impedir que isso aconteça.\"","\n",{"->":".^.^"},{"#f":1}],"B":["^Eu aprovei pessoalmente os requisitos iniciais, mas foi erro meu não me atentar quanto à complexidade e a distribuição de prioridades dessa funcionalidade em específico e é para resolver esse problemas antes que causem muitos danos que fazemos frequentemente reuniões","\n",{"->":".^.^"},{"#f":1}],"C":["^Eu já falei para a (front-end) parar de ficar acusando os stakeholders, não o culpo de ficar estressado, mas como profissional eu esperava que ele não fosse tão temperamental.","\n",{"->":".^.^"},{"#f":1}],"D":["^Foi bastante ofensivo as palavras que ele usou, de certa forma fiquei um pouco revoltada mas tive que me controlar para não perder a cabeça, já conversei com ele a respeito e as devidas providências foram tomadas","\n",{"->":".^.^"},{"#f":1}],"#f":1}],"global decl":["ev",0,{"VAR=":"historyProgression"},"/ev","end",null],"#f":1}],"listDefs":{}}