{"inkVersion":21,"root":[["\n","ev",{"VAR?":"historyProgression"},"/ev",["du","ev",4,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":"Fase1_5_r"},{"->":"0.7"},null]}],["du","ev",5,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->":"Fase1_6_r"},{"->":"0.7"},null]}],"pop","nop","\n","^nada.","\n",["done",{"#f":5,"#n":"g-0"}],null],"done",{"Fase1_5_r":["^Raquel diz que acredita que não é necessário nenhuma mudança já que ela já discutiu isso com os clientes e a Líder de projeto aceitou o planejamento . Independente do que os outros acham, ela vai seguir conforme foi solicitado, voltar nesse assunto causará uma impressão ruim aos clientes e arruinará toda a linha de execução que ela planejou.","\n","end",{"#f":1}],"Fase1_6_r":[["ev","str","^O que acha em relação a suposta discriminação?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^O que acha em relação a esses requisitos?","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^O que acha em relação a forma como o stakeholder reagiu?","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^E quanto ao conflito de Sávio e Felícia?","/str","/ev",{"*":".^.c-3","flg":4},"ev","str","^Até mais","/str","/ev",{"*":".^.c-4","flg":4},{"c-0":["\n",{"->":".^.^.^.A"},{"#f":5}],"c-1":["\n",{"->":".^.^.^.B"},{"#f":5}],"c-2":["\n",{"->":".^.^.^.C"},{"#f":5}],"c-3":["\n",{"->":".^.^.^.D"},{"#f":5}],"c-4":["\n","end",{"#f":5}]}],{"A":["^Quando eu fiz o primeiro planejamento não dei tanta relevância aos detalhes. Cogitei a possibilidade de questionar, já que nunca tinha visto algo parecido, mas segui pelo raciocínio de que eles gostariam de inovar com essa funcionalidade. Contudo, parando para ponderar sobre, independente da forma como eles forem utilizar, a discriminação pode vir a ocorrer.","\n",{"->":".^.^"},{"#f":1}],"B":["^Contudo, parando para ponderar sobre, independente da forma como eles forem utilizar, a nossa equipe terá problemas por entregar a eles, mesmo sabendo que pode gerar alguns danos a sociedade. Então para evitar uma possível","\n",{"->":".^.^"},{"#f":1}],"C":["^Apesar de concordar que Felícia foi incisiva demais e provocou de certa forma a ira dele, acredito que se ele fosse mais profissional manteria a compostura e resolveria isso no diálogo de forma madura. Mas infelizmente não foi o que aconteceu.","\n",{"->":".^.^"},{"#f":1}],"D":["^Apesar de simpatizar com o  Sávio, estou contra ele e a favor de Felícia dessa vez! A entonação com a qual tudo foi dito me deixou com certa indignação, não esperava que ele pensasse assim, estou surpresa de uma forma ruim. Não há muito o que fazer para mudar o passado, todavia espero que ele se redima de alguma forma.","\n",{"->":".^.^"},{"#f":1}],"#f":1}],"global decl":["ev","str","^","/str",{"VAR=":"playerName"},0,{"VAR=":"historyProgression"},"/ev","end",null],"#f":1}],"listDefs":{}}